Autodesk.Revit.DB.HorizontalTextAlignment
Since:
2016
Supported types of horizontal alignment of a text element and text justification within the text containing box.
Since:
2016

Autodesk.Revit.DB.HorizontalTextAlignment.Center
Text is Center justified inside the containing text box, and the center side of the text box remains in place as the width changes.

Autodesk.Revit.DB.HorizontalTextAlignment.Right
Text is Right justified inside the containing text box, and the right side of the text box remains in place as the width changes.

Autodesk.Revit.DB.HorizontalTextAlignment.Left
Text is Left justified inside the containing text box, and the left side of the text box remains in place as the width changes.